import Accordion from "@/components/Accordion";
import AboutHeading from "../AboutHeading/AboutHeading";

export default function AboutSection() {
  return (
    <section className="grid grid-cols-1 lg:grid-cols-2 gap-4 custom-container">
      <div className="flex flex-col gap-2">
        <AboutHeading title={"فیلمکیو کجاست؟"} />
        <p className="leading-[30px] text-[15px]">
          فیلمکیو یک سرویس آنلاین تماشا و دانلود فیلم و سریال است.در فیلمکیو ما
          سعی میکنم جدیدترین و بهترین آثار سینمایی جهان در اختیار همراهان عزیز
          قرار دهیم.بیش از 90% محتوای فیلمکیو رایگان در اختیار همه ی کاربران
          است.برای حمایت از ما در شبکه های اجتماعی ما را دنبال کنید و سایت را به
          دوستان خودتان معرفی کنید همچین در صورت بروز مشکل برای کابران داخل
          ایران همواره آدرس جدید سایت در کانال تلگرام و پیج اینستاگرام معرفی
          میشود.امید داریم با همراهی شما همواره فعالیت خود را در این زمینه ارتقا
          دهیم.برای حمایت از ما می توانید با مبلغ ناچیزی اشتراک تهیه کنید همچین
          تمامی محتوای فیلمکیو بدون حذفیات بوده و فایل بصورت کامل و اورجینال در
          اختیار شما برای دانلود قرار میگیرد.
        </p>
      </div>
      <div className="flex flex-col gap-2">
        <AboutHeading title={"سوالات متداول"} />
        <div className="">
        <Accordion
          title={
            " چرا زمانی که بر روی لینک دانلود کلیک میکنم دانلود نمیشود یا بصورت آنلاین پخش میشود؟"
          }
          text={
            "دانلود از سایت تنها با برنامه ها مدیریت دانلود امکان پذیر میباشد ، به دلیل قوانین جدید گوگل امکان دانلود فایل های حجیم بصورت مستقیم بر روی مرورگر وجود ندارد . به همین منظور کافیست لینک دانلود فیلم مورد نظر خود را از سایت کپی کرده (بر روی لینک کلیک راست کنید یا طولانی لمس نمایید سپس Copy link address) و در دانلود منیجر های معرفی شده وارد نمایید. (برای دانلود Vpn خود را خاموش کنید) "
          }
        />
        <Accordion
          title={"چرا در زمان عضویت با خطا مواجهه می شوم و نمیتوانم عضو شوم؟"}
          text={
            "نام کاربری غیر مجاز است که به دو دلیل است که در زیر خواهیم دید: – کاراکترهای غیرمجاز: فاصله (space) و سایر کاراکتر‌ها )) …! ? * & @ – نام کاربری تکراری: یک نام کاربری رو دو نفر نمیتوانن استفاده کنن و نام کاربری های رند مثل اسم رو با توجه به تعداد عضو های بالا قبلا ثبت شده برای تکراری نبودن آخر نام کاربری عدد اضافه کنید یا حروفی که تکراری نباشد. – حداقل ۴ حرف را وارد کنید ایمیل صحیح نیست که به دو دلیل است که در زیر خواهیم دید: – قبل از هر چیزی باید بدونید ایمیل همان پست الکترونیک شماست و بایستی بدون www وارد شود. اگر ایمیل یا پست الکترونیک صحیح نزنید در موقع فراموشی رمز عبور و بازیابی اکانت با مشکل مواجه خواهید شد. – در ایمیل خود فاصله (space) نزارید هیچ ایمیلی فاصله بین حروف نداره. "
          }
        />
        <Accordion
          title={
            "فیلم یا سریال را دانلود کرده ام ولی زیرنویس ندارد؟"
          }
          text={
            "قبل از هرچیزی قبل از دانلود دقت داشته باشید که محتوای مورد نظر زیرنویس فارسی دارد یا خیر، در صورت داشتن زیرنویس در ۳ بخش درج خواهد شد، ۱- پوستر ۲- متن ۳- اول منو کشویی دانلود به صورت سه گوش، چنانچه نداشته باشد محتوای مورد نظر دارای زیرنویس نیست، همچنین گاهی پیش می آید که پلیر شما به صورت پیشفرض زیرنویس چسبیده پخش نمی کند چنانچه نسخه های سافت ساب (SoftSub) را دانلود نموده اید ، در دستگاه یا پلیر خود ، از منوی تنظیمات ، منوی Subtitle ، چک نموده گزینه زیرنویس فعال باشد و زبان زیرنویس بر روی فارسی (PER or FA) باشد. نکته: در برخی سریال ها زیرنویس به صورت ناقص وجود دارد مثلا چند قسمت از یک فصل دارای زیرنویس است ولی کل فصل تگ زیرنویس خرده که اگر از تنظیمات Subtitle زیرنویس فارسی مشاهده نکردید یعنی زیرنویس ندارد. "
          }
        />
        </div>
      </div>
    </section>
  );
}
